Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Dreaming Freedom.tmx
Source language: en
Languages: es_419

source: her personality is a little weird, just like everyone said...
es_419: TIENE UN CARÁCTER RARO, COMO DICE TODO EL MUNDO…

source: she’s so simple.
es_419: QUÉ SIMPLONA ES.

source: look at her standing alone.
es_419: MÍRENLA, ESTÁ COMPLETAMENTE SOLA…

source: it turned out she was gossiping about me to her clique the whole time.
es_419: AL FINAL, ME ENTERÉ DE QUE LES HABLABA SOBRE MÍ A MIS ESPALDAS.

source: I don’t know if I’m allowed to do this to you...
es_419: NO SÉ SI TENGO PERMITIDO HACERTE ESTO…

source: I’m going back to the classroom.
es_419: VOLVERÉ AL SALÓN.

source: hey, are you serious?!
es_419: ¡¿EN SERIO?!

source: but how?
es_419: ¿CÓMO?

source: I don’t care who or what you are anymore.
es_419: YA NO ME IMPORTA QUIÉN O QUÉ ERES.

source: let’s stop by the snack shop.
es_419: COMPREMOS ALGO EN LA TIENDA.

source: I’m nervous...
es_419: ESTOY NERVIOSA…

source: I’m screwed
es_419: QUÉ MAL…

source: what could that be...?
es_419: ¿QUÉ PODRÁ SER…?

source: it still hurts when I think about what she did to me...
es_419: CUANDO PIENSO EN LO QUE ME HIZO, TODAVÍA ME DUELE UN POCO…

source: how would we have time to eat?
es_419: ¿CREES QUE VAMOS A TENER TIEMPO PARA COMER ALGO?

source: what did you mean by that?
es_419: ¿A QUÉ TE REFIERES?

source: hey, let’s walk to the front gate together.
es_419: CAMINEMOS JUNTAS HASTA LA PUERTA.

source: why is he offering to help me?
es_419: ¿POR QUÉ QUIERE AYUDARME?

source: is that why juhyeon’s in a bad mood?
es_419: ¿POR ESO JUHYEON ESTÁ DE MAL HUMOR?

source: I had no idea she’d go around talking crap about different people in different group chats.
es_419: NO ME IMAGINÉ QUE HABLARÍA MAL DE DISTINTAS PERSONAS EN DIFERENTES CHATS GRUPALES.

source: you said that you can astral project, right?
es_419: PUEDES HACER PROYECCIÓN ASTRAL, ¿NO?

source: we’re gonna go buy makeup, come with.
es_419: NOSOTRAS VAMOS A COMPRAR MAQUILLAJE. ¿QUIERES VENIR?

source: what, that’s why?
es_419: ¿ES POR ESO?

source: you won’t have any fun even if you do come.
es_419: INCLUSO SI VIENES, NO LA PASARÁS BIEN.

source: if you knew what I imagine when I look at you...
es_419: SI SUPIERAS LO QUE ME IMAGINO CUANDO TE VEO…

source: I wish every day could be like today.
es_419: OJALÁ TODOS LOS DÍAS FUERAN ASÍ.

source: I should have just crushed that bitch in grade school
es_419: TENDRÍA QUE HABERLA DESTRUIDO EN PRIMARIA

source: forget it, let’s go back to the room.
es_419: NO IMPORTA. VOLVAMOS AL SALÓN.

source: where’s eunju?
es_419: ¿DÓNDE ESTÁ EUNJU?

source: are you...
es_419: ¿ERES…

source: I could hang out with him casually, but I could never date him seriously lol
es_419: PODRÍA SALIR CON ÉL UN POCO, PERO JAMÁS SERÍA SU NOVIA XD

source: I’m actually not interested at all...
es_419: EN REALIDAD, NO ME INTERESAN…

source: it’s not that bad because I have jaehyeok.
es_419: Y ES PORQUE TENGO A JAEHYEOK.

source: what do you do when you wake up from your dreams?
es_419: ¿QUÉ HACES CUANDO ESTÁS DESPIERTO?

source: have you ever seen her true colors?
es_419: ¿ALGUNA VEZ VISTE SU VERDADERO CARÁCTER?

source: how old are you?
es_419: ¿QUÉ EDAD TIENES?

source: can’t we all just hang out together?
es_419: ¿NO PODEMOS PASAR TIEMPO TODAS JUNTAS?

source: bright
es_419: SONRÍE

source: the two of us were inseparable.
es_419: ÉRAMOS INSEPARABLES.

source: crack
es_419: CRAC

source: it’s okay! trust me!
es_419: ¡NO PASA NADA! ¡CONFÍA EN MÍ!

source: I hope she never shows up again.
es_419: OJALÁ NO VUELVA NUNCA MÁS.

source: you’re right, he’s not.
es_419: TIENES RAZÓN; NO ES MI NOVIO.

source: what kind of nonsense is that...
es_419: QUÉ TONTERÍA…

source: no wonder you can’t see anything, your eyes are covered up.
es_419: POR ESO NO VES NADA; TE CUBRE LOS OJOS.

source: yeah, what’s up?
es_419: SÍ, ¿QUÉ SUCEDE?

source: hi, eunju.
es_419: HOLA, EUNJU.

source: let me ask you something.
es_419: DÉJAME PREGUNTARTE ALGO.

source: I want to get sora choi first.
es_419: PRIMERO QUIERO VENGARME DE SORA CHOI.

source: it feels like I’m the only one who doesn’t have a friend...
es_419: CREO QUE SOY LA ÚNICA SIN COMPAÑERA…

source: ...let me find at least one thing...!
es_419: … ¡QUIERO ENCONTRAR ALGO…!

source: is she...
es_419: ¿ESTÁ…

source: forget what I just said--
es_419: OLVÍDALO…

source: I was worried about you, so--
es_419: ESTABA PREOCUPADO POR TI, POR ESO…

source: you were busy looking down on people if you thought that they were weaker than you.
es_419: TE PASABAS EL DÍA MENOSPRECIANDO A QUIENES CONSIDERABAS MÁS DÉBILES QUE TÚ.

source: salute.
es_419: SALUDEN.

source: when you and I weren’t on good terms,
es_419: CUANDO TÚ Y YO NO NOS HABLÁBAMOS,

source: you liked it when I wasn’t at school, didn’t you?
es_419: TE GUSTÓ VENIR A LA ESCUELA CUANDO YO NO ESTABA, ¿VERDAD?

source: even when people know something can’t be true...
es_419: AUNQUE LA GENTE SEPA QUE ALGO NO PUEDE SER VERDAD…

source: you can use the front door, what are you bitching at us for...
es_419: PUEDES USAR LA PUERTA DEL FRENTE, ¿POR QUÉ VIENES A MOLESTARNOS, INSOPORTABLE…?

source: my poor widdle baby juhyeon!
es_419: ¡POBRECITA, MI JUHYEON HERMOSA!

source: this is the only thing I can do to keep myself from losing it...
es_419: ESTO ES LO ÚNICO QUE PUEDO HACER PARA NO PERDER LA CABEZA…

source: pack up!
es_419: ¡GUARDA TUS COSAS!

source: that was savage
es_419: ESO FUE TREMENDO

source: still, I’m pretty happy compared to when I was being bullied...
es_419: PERO ESTOY MUY FELIZ, A COMPARACIÓN DE CUANDO ME HACÍAN BULLYING…

source: you’re so good at pushing people’s buttons usually, so why can’t you say anything today?
es_419: SIEMPRE SABES CÓMO HACER SENTIR MAL A LOS DEMÁS. ¿POR QUÉ AHORA NO SABES QUÉ DECIR?

source: yeah, and I bet everyone in our class doesn’t like jeongmin, anyway!
es_419: SÍ, ADEMÁS… ¡SEGURO QUE JEONGMIN NO LE CAE BIEN A NADIE!

source: that’s weird...
es_419: QUÉ RARO…

source: oh, right. sora.
es_419: AH, CIERTO. SORA.

source: you’re home...
es_419: LLEGASTE…

source: I’m not the same as I was before...
es_419: NO SOY LA MISMA DE ANTES…

source: it’s delicious...
es_419: ESTÁ DELICIOSO.

source: o-oh, I see...
es_419: AH, YA VEO…

source: why is she suddenly sucking up to you?
es_419: ¿POR QUÉ AHORA VIVE PEGADA A TI?

source: I’m sure there are people who actually want to be class president...
es_419: SÉ QUE DEBE HABER GENTE QUE REALMENTE QUIERA SER PRESIDENTE DE LA CLASE…

source: ...can you get jaehyeok to date me?
es_419: ¿PUEDES HACER QUE JAEHYEOK SALGA CONMIGO?

source: y-you’re right... you’re completely right...
es_419: T-TIENES RAZÓN… TODA LA RAZÓN…

source: jeongmin, are you coming?
es_419: ¿VIENES, JEONGMIN?

source: it’s still hard for me to see her face.
es_419: TODAVÍA SE ME HACE DIFÍCIL MIRARLA A LA CARA.

source: why did you lie to me?
es_419: ¿POR QUÉ ME MENTISTE?

source: huh.
es_419: EH

source: what, you can’t make any friends if I’m not there?
es_419: ¿O ACASO NO PUEDES HACER AMIGOS SI YO NO ESTOY CONTIGO?

source: hey, you!
es_419: ¡OYE!

source: flutter
es_419: UFFF

source: there are times people are desperate enough to believe that mere coincidences are miracles.
es_419: … EN OCASIONES, ESTAMOS TAN DESESPERADOS QUE CREEMOS QUE UNA SIMPLE COINCIDENCIA ES UN MILAGRO.

source: is she even listening to me...?
es_419: ¿ME ESTÁ ESCUCHANDO…?

source: I won’t embarrass you anymore...
es_419: YA NO TE HARÉ QUEDAR MAL OTRA VEZ…

source: she didn’t say anything explicitly...
es_419: NO LO DIJO EXPLÍCITAMENTE…

source: I barely made it out today...
es_419: HOY ME ESCAPÉ DE SUERTE…

source: you thought I was an easy target,
es_419: … PENSASTE QUE YO ERA UN BLANCO FÁCIL.

source: you’re one of the people around me,
es_419: ERES ALGUIEN CON QUIEN PASO TIEMPO,

source: ...the kids in our class stopped picking on me as much.
es_419: LAS DEMÁS YA NO ME MOLESTAN TANTO COMO ANTES.

source: he used to read my texts right away...
es_419: SOLÍA LEER MIS MENSAJES ENSEGUIDA…

source: the conversation is over, I’m leaving her on read lol
es_419: YA NO HABLO MÁS. LA DEJARÉ EN VISTO JAJAJA

source: I was so grateful to juhyeon for that.
es_419: ME SENTÍ MUY AGRADECIDA CON JUHYEON POR LO QUE HIZO.

source: don’t let them get to you...
es_419: NO DEJES QUE TE MOLESTE.

source: what kind of situation I’m in...
es_419: LA SITUACIÓN EN LA QUE ESTOY AHORA…

source: app store books health
es_419: TIENDA LIBROS SALUD

source: but sora suddenly started sucking up to jeongmin,
es_419: PERO AHORA PARECE QUE SORA ESTÁ OBSESIONADA CON JEONGMIN.

source: this might be my chance...
es_419: PODRÍA SER MI OPORTUNIDAD…

source: but don’t worry.
es_419: PERO NO TE PREOCUPES.

source: why not? tell me a story before you go.
es_419: ¿POR QUÉ NO? CUÉNTAME ALGO ANTES DE IRTE.

source: it happens sometimes if you get too used to it.
es_419: A VECES PASA, CUANDO TE ACOSTUMBRAS A HACERLO.

source: then the class president for the first semester is juhyeon! is that alright with you, juhyeon?
es_419: ENTONCES, ¡LA PRESIDENTA DE LA CLASE DE ESTE SEMESTRE ES JUHYEON! ¿ESTÁS DE ACUERDO, JUHYEON?

source: in the old days, I would have beat some sense into you--
es_419: EN OTRA ÉPOCA, TE HABRÍA DADO UNA BUENA LECCIÓN…

source: she has complete evidence.
es_419: TIENE TODA LA EVIDENCIA.

source: didn’t you say you wanted revenge.
es_419: CREÍ QUE QUERÍAS VENGARTE.

source: me too.
es_419: Y YO.

source: wait.
es_419: ESPERA.

source: shit, do you know that my school life is screwed up because of you?!
es_419: ¡¿SABES QUE POR TU CULPA MI VIDA EN LA PREPARATORIA ESTÁ ARRUINADA?!

source: are you serious? who would believe me if I told them?
es_419: ¿EN SERIO? ¿QUIÉN ME CREERÍA?

source: crouch
es_419: AGACHA

source: If you feel that you are being bullied, I think it would be best for you to tell your parents or the adults around you.
es_419: SI PIENSAS QUE TE ESTÁN HACIENDO BULLYING, CREO QUE DEBERÍAS DECÍRSELO A TUS PADRES O A LOS ADULTOS EN LOS QUE CONFÍES.

source: all right, so what do you want to do?
es_419: BUENO, ¿QUÉ QUIERES HACER?

source: Dayun Yeom left the chat
es_419: DAYUN YEOM ABANDONÓ EL CHAT

source: it was just a little satisfying,
es_419: ME SENTÍ BIEN…

source: her??
es_419: ¿ELLA?

source: I dreamt that someone chased me down and stabbed me with a knife.
es_419: SOÑÉ QUE ALGUIEN ME PERSEGUÍA Y ME APUÑALABA CON UN CUCHILLO.

source: if I meet you in my dreams somehow, I’m going to wake up immediately.
es_419: SI VUELVO A VERTE EN MIS SUEÑOS, ME DESPERTARÉ DE INMEDIATO.

source: hey! what am I supposed to do if you don’t go?!
es_419: ¡OYE! ¡¿QUÉ HARÉ SI TÚ NO VAS?!

source: t-then... can I go makeup shopping with you?
es_419: ENTONCES… ¿PUEDO IR A COMPRAR MAQUILLAJE CON USTEDES…?

source: sora, are you in here?
es_419: SORA, ¿ESTÁS AQUÍ?

source: sora choi was talking all kinds of shit about me to her friends, huh?
es_419: ASÍ QUE SORA CHOI LES HABLABA MAL DE MÍ A SUS AMIGAS…

source: yeah, what a coincidence.
es_419: SÍ, QUÉ COINCIDENCIA.

source: it’s partially your fault that I’m like this, too!
es_419: ¡SOY ASÍ TAMBIÉN POR TU CULPA!

source: the person who made you smile like that was juhyeon ha?
es_419: ¿FUE JUHYEON HA LA QUE TE HIZO SONREÍR ASÍ?

source: do it for me.
es_419: HAZLO.

source: what do you think?
es_419: ¿QUÉ TE PARECE?

source: let’s go get your desk.
es_419: VAMOS A BUSCAR TU PUPITRE.

source: she’s really trying...
es_419: SE ESTÁ ESFORZANDO…

source: really? do you have a picture?
es_419: ¿EN SERIO? ¿TIENES UNA FOTO?

source: and jaehyeok...
es_419: Y JAEHYEOK…

source: ...do I have to live like this forever?
es_419: ¿ACASO TENGO QUE VIVIR ASÍ PARA SIEMPRE?

source: juhyeon took you in after everything you did in middle school...
es_419: JUHYEON TE ACEPTÓ A PESAR DE LO QUE HICISTE EN PRIMARIA.

source: I have to be on time at some point, haha.
es_419: ALGUNA VEZ TENÍA QUE LLEGAR A LA HORA CORRECTA. JA, JA.

source: uh-oh...
es_419: RAYOS…

source: you’re free to think whatever you want, but this is too much.
es_419: PIENSA LO QUE QUIERAS, PERO ESTO YA ES DEMASIADO.

source: it makes me want to die in this very spot.
es_419: QUIERO MORIRME AQUÍ MISMO.

source: tell us the truth!
es_419: ¡CUÉNTANOS LA VERDAD!

source: "you do it for me."
es_419: "HAZLO POR MÍ".

source: seeing her go through everything I went through.
es_419: CUANDO LA VI PASAR POR LO MISMO QUE YO.

source: hanuri pharmacy
es_419: FARMACIA HANURI

source: you can rest easily.
es_419: PUEDES QUEDARTE TRANQUILA.

source: hello...?!
es_419: ¡¿HOLA…?!

source: haha, that’s so funny...
es_419: JA, JA. QUÉ DIVERTIDO…

source: screech
es_419: CHIRRIDO

source: you must be hungry. hold on.
es_419: DEBES TENER HAMBRE. ESPERA.

source: I haven’t woken up in months, so I guess it wouldn’t be strange if I was dead.
es_419: HACE MESES QUE NO DESPIERTO; NO SERÍA RARO QUE ESTUVIERA MUERTO.

source: h-how the heck? he’s not a hallucination!
es_419: ¿QUÉ DEMONIOS? ¡NO ES UNA ALUCINACIÓN!

source: ah, I shouldn’t really say stuff like this...
es_419: AH, NO DEBERÍA DECIRLO…

source: you’re acting weird today.
es_419: HOY ESTÁS RARA.

source: t-there’s nothing wrong with friends stepping out for a second!
es_419: ¡N-NO TIENE NADA DE MALO QUE DOS AMIGAS SALGAN A CHARLAR UN MOMENTO!

source: truthfully, I had my suspicions...
es_419: A DECIR VERDAD, TENÍA MIS SOSPECHAS…

source: haha, at least it was fun for a while.
es_419: JA, JA. AL MENOS NOS DIVERTIMOS UN POCO.

source: you don’t want to?
es_419: ¿NO QUIERES?

source: if it’s alright with you, can I call you after school?
es_419: SI TE PARECE BIEN, ¿PUEDO LLAMARTE DESPUÉS DE CLASES?

source: fucking hell...
es_419: ESTO ES UNA MIERDA…

source: did she forget what happened to her last time?
es_419: ¿YA SE OLVIDÓ DE LO QUE LE PASÓ LA ÚLTIMA VEZ?

source: I honestly don’t think astral projection makes any sense...
es_419: REALMENTE CREO QUE LA PROYECCIÓN ASTRAL ES UNA GRAN MENTIRA…

source: lmfaooo starved for affection
es_419: XDXD DESESPERADA POR RECIBIR AFECTO

source: hah... did something happen?
es_419: JA… ¿QUE SI PASÓ ALGO?

source: she said hyejin was making a big deal out of nothing.
es_419: SOLO DIJO QUE HYEJIN ESTÁ EXAGERANDO.

source: ...or so I thought.
es_419: … O ESO PENSÉ.

source: c-cool girl act?
es_419: ¿LA…? ¿LA BUENITA?

source: you’re right, she does look funny.
es_419: ES VERDAD. SE VE GRACIOSA.

source: wait, what...?
es_419: ESPERA, ¿QUÉ…?

source: I’ve really...
es_419: EN REALIDAD…

source: ...but it’s so obvious when you’re thinking up a scheme.
es_419: … PERO SE NOTA CUANDO ESTÁS PLANEANDO HACER ALGO.

source: I don’t know, she’s not picking up my calls.
es_419: NO SÉ. TAMPOCO CONTESTA MIS LLAMADAS.

source: isn’t juhyeon so annoying, though?
es_419: ¿JUHYEON NO LES PARECE MOLESTA?

source: the other day...
es_419: EL OTRO DÍA…

source: she looks creepy, and she did all that stuff to you in grade school.
es_419: ES HORRIBLE Y TE HIZO TODO ESO CUANDO ESTABAN EN PRIMARIA.

source: ...and went to the snack shop together. having friends to do that with was so special to me...
es_419: … Y COMPRAMOS ALGO EN LA TIENDA. FUE TAN ESPECIAL TENER AMIGAS CON QUIENES HACER ESO…

source: huh? but...
es_419: ¿EH? PERO…

source: ...I remember your face all too clearly.
es_419: … TU ROSTRO LO RECUERDO MUY BIEN.

source: o-oh... yeah...
es_419: AH… SÍ…

source: when did you start watching me?
es_419: ¿CUÁNDO EMPEZASTE A OBSERVARME?

source: ah... it’d be kind of weird to stop him just because he dropped a sticker...
es_419: AH… SERÍA RARO LLAMARLO PORQUE SE LE CAYÓ UNA PEGATINA…

source: you know, I heard juhyeon had good grades in middle school too.
es_419: ME ENTERÉ DE QUE JUHYEON TAMBIÉN TENÍA MUY BUENAS NOTAS EN PRIMARIA.

source: I’m back again.
es_419: VOLVÍ.

source: "that's a good idea."
es_419: "QUÉ BUENA IDEA".

source: I basically live here,
es_419: PRÁCTICAMENTE VIVO AQUÍ,

source: for unsavory reasons
es_419: POR MOTIVOS DESAGRADABLES.

source: why aren’t you saying anything?
es_419: ¿POR QUÉ NO DICES NADA?

source: he’s the one that likes me.
es_419: ÉL ES EL QUE ESTÁ INTERESADO EN MÍ.

source: what are you thinking about?
es_419: ¿EN QUÉ ESTÁS PENSANDO?

source: Sujeong Kim left the chat
es_419: SUJEONG KIM ABANDONÓ EL CHAT

source: maybe I didn’t resent her enough, or maybe I was scared of the feeling of hitting another person...
es_419: TAL VEZ NO LA ODIO TANTO O QUIZÁS TENGO MIEDO DE LO QUE SE SIENTE GOLPEAR A OTRA PERSONA…

source: wow... your mom is a total angel...
es_419: GUAU… TU MAMÁ ES GENIAL…

source: who?
es_419: ¿A QUIÉN?

source: disbelief
es_419: INCRÉDULA

source: is there anything else you need?
es_419: ¿NECESITAS ALGO MÁS?

source: what? like who...?
es_419: ¿QUÉ? ¿A QUIÉN TE REFIERES…?

source: lunge
es_419: AVANZA

source: I cared for jeongmin a lot, but I guess she felt suffocated.
es_419: ELLA ME IMPORTABA MUCHO, PERO CREO QUE SE SINTIÓ UN POCO AGOBIADA.

source: even hearing an apology from you makes me sick.
es_419: INCLUSO TUS DISCULPAS ME DAN ASCO.

source: what, now you're ignoring me, you cow?
es_419: ¿AHORA ME IGNORAS, VACA LECHERA?

source: ...maybe things would be a little different.
es_419: … LAS COSAS PODRÍAN SER DIFERENTES.

source: um... jaehyeok...
es_419: EH… JAEHYEOK…

source: I have to grab a pad and go back to the bathroom, but let’s go together when I’m done.
es_419: VOY A BUSCAR UNA TOALLITA Y VUELVO AL BAÑO, PERO VAYAMOS JUNTAS CUANDO TERMINO CON ESO.

source: let’s go, sora.
es_419: VAMOS, SORA.

source: do you really want us to hang out with jeongmin?
es_419: ¿QUIERES QUE NOS JUNTEMOS CON JEONGMIN?

source: I wanted to be friends after we met again in high school, but it looks like she doesn’t want to.
es_419: QUISE RETOMAR LA AMISTAD CUANDO NOS ENCONTRAMOS EN LA PREPARATORIA, PERO CREO QUE ELLA NO.

source: aw yeah, i get it. she hasn’t said anything to me though
es_419: SÍ, TE ENTIENDO, PERO A MÍ NO ME DIJO NADA…

source: why would I need your help?
es_419: ¿POR QUÉ NECESITARÍA DE TU AYUDA?

source: you want to do that too, deep down...
es_419: SÉ QUE TÚ TAMBIÉN QUIERES HACERLO.

source: oh.
es_419: AH.

source: you’re still upset?
es_419: ¿SIGUES MOLESTA?

source: ...but it’s all right.
es_419: … PERO ESTÁ BIEN.

source: she’s just ordering me around...
es_419: ME VIVE DANDO ÓRDENES…

source: I hope everyone gets hit by a car and dies :) isn’t high school too late to still be playing mean girls...
es_419: ESPERO QUE LAS ATROPELLEN Y SE MUERAN :) ¿NO ESTÁN DEMASIADO GRANDES PARA HACERSE LAS MALAS EN LA PREPARATORIA…?

source: ...do you think that guy she was talking about yesterday is real?
es_419: ¿CREES QUE ESE CHICO DEL QUE HABLABA AYER ES REAL?

source: did juhyeon do this to you?
es_419: ¿JUHYEON TE HIZO ESO?

source: hey!
es_419: ¡OYE!

source: okay, jeez... you didn’t have to yell...
es_419: BUENO, ESTÁ BIEN… NO TIENES QUE GRITARME…

source: I knew you’d do this.
es_419: SABÍA QUE HARÍAS ESTO.

source: ...it feels like the two of them have been subtly leaving me out of plans more often...
es_419: … SIENTO QUE LAS DOS ME DEJAN POCO A POCO FUERA DE TODOS SUS PLANES…

source: aaah!
es_419: ¡AHHHH!

source: she’s still not sleeping. she just keeps looking at her phone.
es_419: AÚN NO DUERME. SOLO SE QUEDA VIENDO SU CELULAR.

source: but I like using yours!
es_419: ¡PERO ME GUSTA!

source: don’t even come near us anymore, either. you’re filthy.
es_419: Y NO TE ACERQUES A NOSOTRAS. ERES UN ASCO.

source: is math next?
es_419: ¿SIGUE MATEMÁTICA?

source: do you know what league of negends is?
es_419: ¿CONOCES LEAGUE OF NEGENDS?

source: I-I mean...!
es_419: ¡QUIERO DECIR…!

source: we still have a lot of time left in our academic careers.
es_419: TENEMOS MUCHO TIEMPO POR DELANTE EN NUESTRA CARRERA ACADÉMICA.

source: I’d be sick of dealing with someone like me, too--
es_419: YO TAMBIÉN ESTARÍA HARTA DE PASAR TIEMPO CON ALGUIEN COMO YO…

source: does it make you that happy?
es_419: ¿ESO TE PONE TAN FELIZ?

source: ...even though we were best friends in elementary school.
es_419: … AUNQUE EN LA ESCUELA PRIMARIA ÉRAMOS MEJORES AMIGAS.

source: how are you going to function in society?
es_419: ¿CÓMO HARÁS CUANDO SALGAS A LA VIDA REAL?

source: but it’s already the middle of the month!
es_419: ¡PERO YA ESTAMOS A MITAD DE MES!

source: ...so people usually leave their things in the classroom.
es_419: … POR ESO TODOS DEJAN SUS COSAS EN EL SALÓN.

source: ...that murdering someone is a piece of cake to me.
es_419: … MATAR A ALGUIEN ES PAN COMIDO PARA MÍ.

source: thanks for saying that.
es_419: GRACIAS POR DECIRME ESO.

source: talking phase?
es_419: ¿CONOCIÉNDOLA?

source: ...but not me.
es_419: … PERO YO NO.

source: just what is she thinking??
es_419: ¿EN QUÉ ESTÁ PENSANDO?

source: how is that possible--
es_419: CÓMO ES POSIBLE…

source: let’s get revenge on her together.
es_419: VAMOS A VENGARNOS DE ELLA.

source: what a useless boy.
es_419: QUÉ CHICO INSERVIBLE.

source: I thought I was going to piss myself.
es_419: PENSÉ QUE ME IBA A HACER PIS.

source: go on.
es_419: VAYAN.

source: ...I’ve just been calling out juhyeon to tell her what’s on my mind.
es_419: … SOLO LE HE DICHO A JUHYEON LO QUE PIENSO.

source: what? really?
es_419: ¿QUÉ? ¿EN SERIO?

source: I’m screwed.
es_419: QUÉ DESASTRE.

source: I really didn’t mean to do that...!
es_419: ¡NO QUISE HACERLO…!

source: is someone like me really allowed to be with them?
es_419: ¿EN SERIO ALGUIEN COMO YO PUEDE PASAR EL TIEMPO CON ELLAS?

source: her school is right next to mine, and all...
es_419: SU ESCUELA ESTÁ JUNTO A LA MÍA, ADEMÁS…

source: I-I just want to be friends with her since she’s new!
es_419: COMO ES NUEVA AQUÍ, ¡SOLO QUIERO SER SU AMIGO!

source: ...never should have met you either.
es_419: … TAMPOCO DEBÍ HABERTE CONOCIDO.

source: just now.
es_419: RECIÉN.

source: ...and there are some things that I don’t want others to know.
es_419: Y HAY COSAS QUE NO QUIERO QUE NADIE SEPA.

source: so don’t get any weird expectations.
es_419: NO TE HAGAS IDEAS RARAS.

source: ah, maybe this is too much.
es_419: AH, QUIZÁS SEA DEMASIADO.

source: yeonji, I talked to that guy you told me about a few times and now I understand what you mean
es_419: YEONJI, HABLÉ CON ESE CHICO QUE MENCIONASTE UN PAR DE VECES Y YA TE ENTIENDO

source: I’m itching to tell them...
es_419: QUIERO CONTARLES…

source: juhyeon and her friends don’t like you,
es_419: NO LES CAES BIEN A JUHYEON Y SUS AMIGAS…

source: I had the wrong idea...
es_419: ESTABA EQUIVOCADA…

source: I thought those were empty words he was saying just to be polite...
es_419: PENSÉ QUE SOLO LO HABÍA DICHO PARA SER AMABLE…

source: if you think I’m a good person...
es_419: SI CREES QUE SOY BUENA PERSONA…

source: oh, her social media?!
es_419: ¡¿LO DE SUS REDES SOCIALES?!

source: did I do anything to make you think there was something between us...?
es_419: ¿HICE ALGO PARA QUE CREYERAS QUE ESTÁBAMOS SALIENDO…?

source: there’s something you seem to be forgetting.
es_419: CREO QUE TE OLVIDAS DE ALGO.

source: but surprisingly, you’re calm and suspicious of me.
es_419: PERO VEO QUE TE MANTIENES EN CALMA Y QUE SOSPECHAS DE MÍ. QUÉ SORPRESA.

source: I honestly want to ask him to make those girls disappear...
es_419: ME GUSTARÍA PEDIRLE QUE HICIERA DESAPARECER A LAS CHICAS…

source: how was your day?
es_419: ¿CÓMO ESTUVO TU DÍA?

source: we don’t have to pair up in number order?
es_419: ¿NO TENEMOS QUE FORMAR PAREJA POR NÚMERO?

source: if he really is the man juhyeon was talking about...
es_419: SI REALMENTE ES EL HOMBRE DEL QUE HABLABA JUHYEON…

source: ...told my mom that I was being bullied...
es_419: SI LE DIGO A MI MAMÁ QUE ME HACEN BULLYING…

source: is that her?
es_419: ¿ES ELLA?

source: not you, hyejin. you fool around too much.
es_419: TÚ NO, HYEJIN. ESTÁS TODO EL DÍA PERDIENDO EL TIEMPO.
